package 数据结构与算法.算法系统练习.历年真题.java_B_C组;

/**
 * 对应包围层数的该标志。
 * 为了能准确比对空白的数量，程序要求对行中的空白以句点（.）代替。
 * 　　例如：
 * 　　用户输入：
 * 　　1
 * 　　程序应该输出：
 * 　　..$..
 * 　　..$...$..
 * 　　$
 * 　　$...$...$
 * 　　$.$.$
 * 　　$...$...$
 * 　　$
 * 　　..$...$..
 * 　　..$..
 *
 * 　　再例如：
 * 　　用户输入：
 * 　　3
 * 　　程序应该输出：
 * 　　..$..
 * 　　..$...........$..
 * 　　$
 * 　　$...$.......$...$
 * 　　$.$.$
 * 　　$.$...$...$...$.$
 * 　　$.$.$.$.$
 * 　　$.$.$...$...$.$.$
 * 　　$.$.$.$.$.$.$
 * 　　$.$.$...$...$.$.$
 * 　　$.$.$.$.$
 * 　　$.$...$...$...$.$
 * 　　$.$.$
 * 　　$...$.......$...$
 * 　　$
 * 　　..$...........$..
 * 　　..$..
 */
public class _08打印十字图 {
  public static void main(String[] args) {

  }
}
